tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MIMXRT1176xxxxx
package_id: MIMXRT1176DVMAA
mcu_data: ksdk2_0
processor_version: 16.3.0
board: MIMXRT1170-EVK
pin_labels:
- {pin_num: K1, pin_signal: GPIO_EMC_B1_40, label: 'SEMC_RDY/U14A[C8]', identifier: SEMC_RDY;LPUART6_TXD}
- {pin_num: L1, pin_signal: GPIO_EMC_B1_41, label: 'SEMC_CSX0/U14A[C6]', identifier: SEMC_CSX0;LPUART6_RXD}
- {pin_num: M1, pin_signal: GPIO_EMC_B2_04, label: 'SEMC_D20/U25[8]', identifier: SEMC_D20;ENET_1G_TXD2}
- {pin_num: N1, pin_signal: GPIO_EMC_B2_05, label: 'SEMC_D21/U25[10]', identifier: SEMC_D21;ENET_1G_RX_CLK}
- {pin_num: P1, pin_signal: GPIO_EMC_B2_08, label: 'SEMC_DM2/U25[15]', identifier: SEMC_DM2;ENET_1G_RXD2}
- {pin_num: R1, pin_signal: GPIO_EMC_B2_03, label: 'SEMC_D19/U25[7]', identifier: SEMC_D19;BG95_RESET}
- {pin_num: T1, pin_signal: GPIO_EMC_B2_06, label: 'SEMC_D22/U25[11]', identifier: SEMC_D22;GPIO8_IO16}
- {pin_num: K2, pin_signal: GPIO_EMC_B2_00, label: 'SEMC_D16/U25[2]', identifier: SEMC_D16;LPSPI1_SCK}
- {pin_num: L2, pin_signal: GPIO_EMC_B2_15, label: 'SEMC_D30/U25[51]', identifier: SEMC_D30;ENET_1G_RXD0}
- {pin_num: M2, pin_signal: GPIO_EMC_B2_12, label: 'SEMC_D27/U25[47]', identifier: SEMC_D27;ENET_1G_TXD1}
- {pin_num: N2, pin_signal: GPIO_EMC_B2_09, label: USER_LED_1, identifier: SEMC_D24;USER_LED_2;USER_LED_1}
- {pin_num: P2, pin_signal: GPIO_EMC_B2_16, label: 'SEMC_D31/U25[53]', identifier: SEMC_D31;ENET_1G_RXD1}
- {pin_num: R2, pin_signal: GPIO_EMC_B2_10, label: USER_LED_2, identifier: USER_LED_2}
- {pin_num: T2, pin_signal: GPIO_EMC_B2_17, label: 'SEMC_DM3/U25[39]', identifier: SEMC_DM3;ENET_1G_RX_EN}
- {pin_num: U2, pin_signal: GPIO_EMC_B2_19, label: ENET_RGMII_MDC, identifier: ENET_RGMII_MDC;ENET_QOS_MDC}
- {pin_num: K3, pin_signal: GPIO_EMC_B2_02, label: 'SEMC_D18/U25[5]', identifier: SEMC_D18;BG95_PWRKEY}
- {pin_num: M3, pin_signal: GPIO_EMC_B2_07, label: 'SEMC_D23/U25[13]', identifier: SEMC_D23;ENET_1G_RXD3}
- {pin_num: N3, pin_signal: GPIO_EMC_B2_18, label: SEMC_DQS4, identifier: SEMC_DQS4;USER_BUTTON}
- {pin_num: R3, pin_signal: GPIO_EMC_B2_20, label: ENET_RGMII_MDIO, identifier: ENET_RGMII_MDIO;ENET_1G_MDIO}
- {pin_num: K4, pin_signal: GPIO_EMC_B2_01, label: 'SEMC_D17/U25[4]', identifier: SEMC_D17;LPSPI1_PCS0}
- {pin_num: L4, pin_signal: GPIO_EMC_B2_11, label: 'SEMC_D26/U25[45]', identifier: SEMC_D26;ENET_1G_T;ENET_1G_TXD0}
- {pin_num: M4, pin_signal: GPIO_EMC_B2_14, label: 'SEMC_D29/U25[50]', identifier: SEMC_D29;ENET_1G_CLKIO}
- {pin_num: K5, pin_signal: GPIO_EMC_B2_13, label: 'SEMC_D28/U25[48]', identifier: SEMC_D28;ENET_1G_TX_EN}
- {pin_num: N12, pin_signal: GPIO_AD_00, label: 'SIM1_TRXD/J44[C7]/J57[9]/CTP_INT/J48[29]/J25[15]/J9[14]', identifier: SIM1_TRXD;CAN2_TX}
- {pin_num: E14, pin_signal: GPIO_SD_B2_05, label: 'FlexSPI_A_DQS/U21[C3]', identifier: FlexSPI_A_DQS;SDHC2_CMD}
- {pin_num: F14, pin_signal: GPIO_SD_B2_04, label: 'FlexSPI_B_CLK/U21[B1]', identifier: FlexSPI_B_CLK;SDHC2_CLK}
- {pin_num: R14, pin_signal: GPIO_AD_01, label: 'SIM1_CLK/J44[C3]/J57[7]/CTP_RST_B/J48[28]/J10[4]/J25[13]', identifier: SIM1_CLK;CAN2_RX}
- {pin_num: H13, pin_signal: GPIO_SD_B2_02, label: 'FlexSPI_B_D1/U21[E3]', identifier: FlexSPI_B_D1;SDHC2_DATA1}
- {pin_num: G14, pin_signal: GPIO_SD_B2_07, label: 'FlexSPI_A_CLK/U23[6]/U21[B2]', identifier: FlexSPI_A_CLK;DIG_IN_1;DIG_IN}
- {pin_num: H14, pin_signal: GPIO_SD_B2_10, label: 'FlexSPI_A_D2/U23[3]/U21[C4]', identifier: FlexSPI_A_D2;DIG_IN_4}
- {pin_num: J14, pin_signal: GPIO_SD_B2_01, label: 'FlexSPI_B_D2/U21[E2]', identifier: FlexSPI_B_D2;SDHC2_DATA2}
- {pin_num: E15, pin_signal: GPIO_SD_B2_03, label: 'FlexSPI_B_D0/U21[D5]', identifier: FlexSPI_B_D0;SDHC2_DATA0}
- {pin_num: F15, pin_signal: GPIO_SD_B2_08, label: 'FlexSPI_A_D0/U23[5]/U21[D3]', identifier: FlexSPI_A_D0;DIG_IN_2}
- {pin_num: H15, pin_signal: GPIO_SD_B2_09, label: 'FlexSPI_A_D1/U23[2]/U21[D2]', identifier: FlexSPI_A_D1;DIG_IN_3}
- {pin_num: J15, pin_signal: GPIO_SD_B2_00, label: 'FlexSPI_B_D3/U21[E1]', identifier: FlexSPI_B_D3;SDHC2_DATA3}
- {pin_num: F16, pin_signal: GPIO_SD_B2_11, label: 'FlexSPI_A_D3/U23[7]/U21[D4]', identifier: FlexSPI_A_D3;RESET_ETH}
- {pin_num: F17, pin_signal: GPIO_SD_B2_06, label: 'FlexSPI_A_SS0/U23[1]/U21[C2]', identifier: FlexSPI_A_SS0;ENET_1G_TXD3}
- {pin_num: P5, pin_signal: GPIO_LPSR_09, label: 'DMIC_DATA0/U41[5]/J50[20]/LPSPI6_CS0/J26[11]', identifier: DMIC_DATA0;LPI2C5_SCL;LPUART11_RXD}
- {pin_num: P6, pin_signal: GPIO_LPSR_02, label: 'BOOT_MODE[0]', identifier: BOOTMOD;BOOTMODE_1}
- {pin_num: T7, pin_signal: GPIO_LPSR_03, label: 'BOOT_MODE[1]', identifier: BOOTMODE_0}
- {pin_num: U8, pin_signal: GPIO_LPSR_08, label: 'DMIC_CLK/U41[1]/U44[1]/J50[18]', identifier: DMIC_CLK;LPI2C5_SDA;LP;LPUART11_TXD}
- {pin_num: E13, pin_signal: GPIO_DISP_B1_00, label: 'ENET_RGMII_RX_EN/U10[26]', identifier: ENET_RGMII_RX_EN;IRQ_PE}
- {pin_num: D13, pin_signal: GPIO_DISP_B1_01, label: 'ENET_RGMII_RXC/U10[27]', identifier: ENET_RGMII_RXC;ENET_QOS_RX_CLK}
- {pin_num: D11, pin_signal: GPIO_DISP_B1_02, label: 'ENET_RGMII_RXD0/U10[25]', identifier: ENET_RGMII_RXD0;DSI_CTP_IRQ}
- {pin_num: E11, pin_signal: GPIO_DISP_B1_03, label: 'ENET_RGMII_RXD1/U10[24]', identifier: ENET_RGMII_RXD1;ADC_INT}
- {pin_num: E10, pin_signal: GPIO_DISP_B1_04, label: 'ENET_RGMII_RXD2/U10[23]', identifier: ENET_RGMII_RXD2;ENET_QOS_RXD2}
- {pin_num: C11, pin_signal: GPIO_DISP_B1_05, label: 'ENET_RGMII_RXD3/U10[22]', identifier: ENET_RGMII_RXD3;ENET_QOS_RXD3}
- {pin_num: D10, pin_signal: GPIO_DISP_B1_06, label: 'ENET_RGMII_TXD3/U10[15]/BT_CFG[0]', identifier: ENET_RGMII_TXD3;ENET_QOS_TXD3}
- {pin_num: E12, pin_signal: GPIO_DISP_B1_07, label: 'ENET_RGMII_TXD2/U10[16]/BT_CFG[1]', identifier: ENET_RGMII_TXD2;ENET_QOS_TXD2}
- {pin_num: A15, pin_signal: GPIO_DISP_B1_08, label: 'ENET_RGMII_TXD1/U10[17]/BT_CFG[2]', identifier: ENET_RGMII_TXD1;BOOTCFG_2}
- {pin_num: C13, pin_signal: GPIO_DISP_B1_09, label: 'ENET_RGMII_TXD0/U10[18]/BT_CFG[3]', identifier: ENET_RGMII_TXD0;BOOTCFG_3}
- {pin_num: B14, pin_signal: GPIO_DISP_B1_10, label: 'ENET_RGMII_TX_EN/U10[19]/BT_CFG[4]', identifier: ENET_RGMII_TX_EN;BOOTCFG_4}
- {pin_num: A14, pin_signal: GPIO_DISP_B1_11, label: 'ENET_RGMII_TXC/U10[20]/BT_CFG[5]', identifier: ENET_RGMII_TXC;BOOTCFG_5}
- {pin_num: E9, pin_signal: GPIO_DISP_B2_02, label: 'ENET_TXD0/U7[24]/BT_CFG[8]', identifier: ENET_TXD0;ENET_QOS_TXD0}
- {pin_num: D7, pin_signal: GPIO_DISP_B2_03, label: 'ENET_TXD1/U7[25]/BT_CFG[9]', identifier: ENET_TXD1;ENET_QOS_TXD1}
- {pin_num: C7, pin_signal: GPIO_DISP_B2_04, label: 'ENET_TXEN/U7[23]/BT_CFG[10]', identifier: ENET_TXEN;ENET_QOS_TX_EN}
- {pin_num: C9, pin_signal: GPIO_DISP_B2_05, label: 'ENET_TX_REF_CLK/U7[9]/BT_CFG[11]', identifier: ENET_TX_REF_CLK;ENET_QOS_TXCLK}
- {pin_num: C6, pin_signal: GPIO_DISP_B2_06, label: 'ENET_RXD0/U7[16]', identifier: ENET_RXD0;ENET_QOS_RXD0}
- {pin_num: D6, pin_signal: GPIO_DISP_B2_07, label: 'ENET_RXD1/U7[15]', identifier: ENET_RXD1;ENET_QOS_RXD1}
- {pin_num: B5, pin_signal: GPIO_DISP_B2_08, label: 'ENET_CRS_DV/U7[18]', identifier: ENET_CRS_DV;ENET_QOS_RX_EN}
- {pin_num: D8, pin_signal: GPIO_DISP_B2_09, label: 'ENET_RXER/U7[20]', identifier: ENET_RXER;BT_PD}
- {pin_num: D9, pin_signal: GPIO_DISP_B2_10, label: 'LPUART2_TXD/BT_UART_TXD/U354[4]/U16[2]/J25[3]/J9[4]', identifier: BT_UART_TXD;LPI2C3_SCL}
- {pin_num: A6, pin_signal: GPIO_DISP_B2_11, label: 'LPUART2_RXD/BT_UART_RXD/U16[3]/U355[20]/J9[2]', identifier: BT_UART_RXD;LPI2C3_SDA}
- {pin_num: B6, pin_signal: GPIO_DISP_B2_12, label: 'RGMII1_PHY_INTB/U10[31]/BT_UART_CTS/U16[5]/U355[19]/J9[6]', identifier: GPIO_DISP_B2_12;LPSPI4_SCK}
- {pin_num: A5, pin_signal: GPIO_DISP_B2_13, label: 'INT1_COMBO/BT_UART_RTS/U16[4]/U354[5]/ETHPHY_RST_B/U10[12]', identifier: BT_UART_RTS;LPSPI4_SIN}
- {pin_num: A7, pin_signal: GPIO_DISP_B2_14, label: INT2_COMBO/CSI_RST_B, identifier: LPSPI4_SOUT}
- {pin_num: A4, pin_signal: GPIO_DISP_B2_15, label: 'WDOG_B/LCM_PWR_EN/J48[32]', identifier: LPSPI4_PCS0}
- {pin_num: R13, pin_signal: GPIO_AD_02, label: RS485_UART_TX / BLUETOOTH_UART_TX, identifier: SIM1_RST;RS485;RS485_TXD;LPUART8_TX}
- {pin_num: P15, pin_signal: GPIO_AD_03, label: RS485_UART_RX / BLUETOOTH_UART_RX, identifier: SIM1_SVEN;RS485_RXD;LPUART8_CTS;LPUART8_RX}
- {pin_num: M13, pin_signal: GPIO_AD_04, label: RS485_UART_CTS / BLUETOOTH_UART_CTS, identifier: SIM1_PD;RS485_CTS;RS485_Transmit_Enable;RS485_TRAN_EN;LPUART8_CTS}
- {pin_num: P13, pin_signal: GPIO_AD_05, label: RS485_UART_RTS / BLUETOOTH_UART_RTS, identifier: SIM1_PWR_FAIL;RS485_RTS;LPUART8_RTS}
- {pin_num: N13, pin_signal: GPIO_AD_06, label: 'USB_OTG2_OC/U18[A2]/J9[10]/AUD_INT', identifier: USB2_OC}
- {pin_num: T17, pin_signal: GPIO_AD_07, label: 'USB_OTG2_PWR/WL_DEV_WAKE/U354[10]/J10[2]', identifier: USB2_PWR}
- {pin_num: R15, pin_signal: GPIO_AD_08, label: 'USB_OTG2_ID/U20[3]/U18[A1]/J26[12]/J18[4]', identifier: USB2_ID}
- {pin_num: R16, pin_signal: GPIO_AD_09, label: 'USB_OTG1_ID/U28[3]/U26[A1]/J26[10]/J20[4]', identifier: USB1_ID}
- {pin_num: R17, pin_signal: GPIO_AD_10, label: 'USB_OTG1_PWR/J26[2]/U26[A1]', identifier: USB1_PWR}
- {pin_num: P16, pin_signal: GPIO_AD_11, label: 'USB_OTG1_OC/U26[A2]/J26[4]', identifier: USB1_OC}
- {pin_num: P17, pin_signal: GPIO_AD_12, label: 'SPDIF_LOCK/J26[6]/ENET_INT/U7[21]', identifier: ADC_RST}
- {pin_num: L12, pin_signal: GPIO_AD_13, label: 'SPDIF_SR_CLK/ANATOP_32K_OUT/J26[8]', identifier: ADC_SYNC}
- {pin_num: N14, pin_signal: GPIO_AD_14, label: ADC_DATA_RDY, identifier: ADC_DATA_RDY;ADC_DATA_RD}
- {pin_num: M14, pin_signal: GPIO_AD_15, label: 'SPDIF_IN/U43[4]/BT_RST#/U16[14]/J54[54]', identifier: SPDIF_IN;DSI_LPTE}
- {pin_num: N17, pin_signal: GPIO_AD_16, label: 'SPDIF_OUT/WIFI_RST_B/U354[3]', identifier: SPDIF_OUT;ENET_1G_MDC}
- {pin_num: L14, pin_signal: GPIO_AD_26, label: 'CSI_PWR_CTL/USER_LED_CTL2/J50[16]', identifier: PWM2_A1}
- {pin_num: N16, pin_signal: GPIO_AD_27, label: 'BT_HOST_WAKE/U16[38]/BT_WAKE_B_3V3/J54[20]', identifier: BT_WAKE_B_3V3;ENET_QOS_MDIO}
- {pin_num: L17, pin_signal: GPIO_AD_28, label: 'LPSPI1_SCK/U27[6]/BT_DEV_WAKE/U354[9]/U16[39]/J10[12]', identifier: LPSPI1_SCK;PWM2_A2}
- {pin_num: M17, pin_signal: GPIO_AD_29, label: 'LPSPI1_PCS0/U27[1]/J10[6]/J10[3]/WL_HOST_WAKE/U16[27]/WIFI_WAKE_B_3V3/U355[21]', identifier: LPSPI1_PCS0;WLAN_PD}
- {pin_num: K17, pin_signal: GPIO_AD_30, label: 'LPSPI1_SDO/U27[5]/J10[8]/Backlight_CTL/J48[34]/U46[4]', identifier: LPSPI1_SDO;LPSPI1_SOUT}
- {pin_num: J17, pin_signal: GPIO_AD_31, label: 'LPSPI1_SDI/U27[2]/J10[10]', identifier: LPSPI1_SDI;LPSPI1_SIN}
- {pin_num: K16, pin_signal: GPIO_AD_32, label: 'ENET_MDC/U7[12]/SD1_CD_B/J15[9]', identifier: ENET_MDC;SDHC1_CD;CD_N;SDHC1_CD_N}
- {pin_num: H17, pin_signal: GPIO_AD_33, label: 'ENET_MDIO/U7[11]', identifier: ENET_MDIO;SDHC1;SDHC1_WP}
- {pin_num: J16, pin_signal: GPIO_AD_34, label: 1588_EVENT0_IN/SD1_VSELECT, identifier: SD1_VSELECT;SDHC1_VSELECT}
- {pin_num: G17, pin_signal: GPIO_AD_35, label: 1588_EVENT0_OUT/SD_PWREN_B, identifier: SD_PWREN_B;SDHC1_RESET;SDHC1_RESET_N}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

