tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: M15, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: L13, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: R6, peripheral: CAN3, signal: RX, pin_signal: GPIO_LPSR_01, software_input_on: Enable}
  - {pin_num: N6, peripheral: CAN3, signal: TX, pin_signal: GPIO_LPSR_00, software_input_on: Enable}
  - {pin_num: R14, peripheral: CAN2, signal: RX, pin_signal: GPIO_AD_01, identifier: CAN2_RX, software_input_on: Enable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
  - {pin_num: N12, peripheral: CAN2, signal: TX, pin_signal: GPIO_AD_00, identifier: CAN2_TX, software_input_on: Enable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
  - {pin_num: R13, peripheral: LPUART8, signal: TXD, pin_signal: GPIO_AD_02, identifier: LPUART8_TX, software_input_on: Enable}
  - {pin_num: P15, peripheral: LPUART8, signal: RXD, pin_signal: GPIO_AD_03, identifier: LPUART8_RX, software_input_on: Enable}
  - {pin_num: R8, peripheral: LPI2C6, signal: SCL, pin_signal: GPIO_LPSR_07, software_input_on: Enable, pull_up_down_config: no_init, slew_rate: Fast}
  - {pin_num: P8, peripheral: LPI2C6, signal: SDA, pin_signal: GPIO_LPSR_06, software_input_on: Enable, pull_up_down_config: no_init, slew_rate: Fast}
  - {pin_num: D13, peripheral: ENET_QOS, signal: enet_rx_clk, pin_signal: GPIO_DISP_B1_01, identifier: ENET_QOS_RX_CLK}
  - {pin_num: E10, peripheral: ENET_QOS, signal: 'enet_rdata, 02', pin_signal: GPIO_DISP_B1_04, identifier: ENET_QOS_RXD2}
  - {pin_num: C11, peripheral: ENET_QOS, signal: 'enet_rdata, 03', pin_signal: GPIO_DISP_B1_05, identifier: ENET_QOS_RXD3}
  - {pin_num: D10, peripheral: ENET_QOS, signal: 'enet_tdata, 03', pin_signal: GPIO_DISP_B1_06, identifier: ENET_QOS_TXD3, pull_down_pull_up_config: No_Pull}
  - {pin_num: E12, peripheral: ENET_QOS, signal: 'enet_tdata, 02', pin_signal: GPIO_DISP_B1_07, identifier: ENET_QOS_TXD2}
  - {pin_num: A3, peripheral: SEMC, signal: 'ADDR, 00', pin_signal: GPIO_EMC_B1_09}
  - {pin_num: A2, peripheral: SEMC, signal: 'ADDR, 01', pin_signal: GPIO_EMC_B1_10}
  - {pin_num: C2, peripheral: SEMC, signal: 'ADDR, 02', pin_signal: GPIO_EMC_B1_11}
  - {pin_num: C5, peripheral: SEMC, signal: 'ADDR, 03', pin_signal: GPIO_EMC_B1_12}
  - {pin_num: D5, peripheral: SEMC, signal: 'ADDR, 04', pin_signal: GPIO_EMC_B1_13}
  - {pin_num: B1, peripheral: SEMC, signal: 'ADDR, 05', pin_signal: GPIO_EMC_B1_14}
  - {pin_num: C1, peripheral: SEMC, signal: 'ADDR, 06', pin_signal: GPIO_EMC_B1_15}
  - {pin_num: D3, peripheral: SEMC, signal: 'ADDR, 07', pin_signal: GPIO_EMC_B1_16}
  - {pin_num: B3, peripheral: SEMC, signal: 'ADDR, 08', pin_signal: GPIO_EMC_B1_17}
  - {pin_num: B4, peripheral: SEMC, signal: 'ADDR, 09', pin_signal: GPIO_EMC_B1_18}
  - {pin_num: B2, peripheral: SEMC, signal: 'ADDR, 10', pin_signal: GPIO_EMC_B1_23}
  - {pin_num: C4, peripheral: SEMC, signal: 'ADDR, 11', pin_signal: GPIO_EMC_B1_19}
  - {pin_num: C3, peripheral: SEMC, signal: 'ADDR, 12', pin_signal: GPIO_EMC_B1_20}
  - {pin_num: F3, peripheral: SEMC, signal: 'DATA, 00', pin_signal: GPIO_EMC_B1_00}
  - {pin_num: F2, peripheral: SEMC, signal: 'DATA, 01', pin_signal: GPIO_EMC_B1_01}
  - {pin_num: G4, peripheral: SEMC, signal: 'DATA, 02', pin_signal: GPIO_EMC_B1_02}
  - {pin_num: E4, peripheral: SEMC, signal: 'DATA, 03', pin_signal: GPIO_EMC_B1_03}
  - {pin_num: H5, peripheral: SEMC, signal: 'DATA, 04', pin_signal: GPIO_EMC_B1_04}
  - {pin_num: F4, peripheral: SEMC, signal: 'DATA, 05', pin_signal: GPIO_EMC_B1_05}
  - {pin_num: H4, peripheral: SEMC, signal: 'DATA, 06', pin_signal: GPIO_EMC_B1_06}
  - {pin_num: H3, peripheral: SEMC, signal: 'DATA, 07', pin_signal: GPIO_EMC_B1_07}
  - {pin_num: E3, peripheral: SEMC, signal: 'DATA, 08', pin_signal: GPIO_EMC_B1_30}
  - {pin_num: D2, peripheral: SEMC, signal: 'DATA, 09', pin_signal: GPIO_EMC_B1_31}
  - {pin_num: D1, peripheral: SEMC, signal: 'DATA, 10', pin_signal: GPIO_EMC_B1_32}
  - {pin_num: E2, peripheral: SEMC, signal: 'DATA, 11', pin_signal: GPIO_EMC_B1_33}
  - {pin_num: E1, peripheral: SEMC, signal: 'DATA, 12', pin_signal: GPIO_EMC_B1_34}
  - {pin_num: F1, peripheral: SEMC, signal: 'DATA, 13', pin_signal: GPIO_EMC_B1_35}
  - {pin_num: G1, peripheral: SEMC, signal: 'DATA, 14', pin_signal: GPIO_EMC_B1_36}
  - {pin_num: J1, peripheral: SEMC, signal: 'DM, 1', pin_signal: GPIO_EMC_B1_38}
  - {pin_num: F5, peripheral: SEMC, signal: 'DM, 0', pin_signal: GPIO_EMC_B1_08}
  - {pin_num: J5, peripheral: SEMC, signal: semc_cas, pin_signal: GPIO_EMC_B1_24}
  - {pin_num: G2, peripheral: SEMC, signal: 'BA, 0', pin_signal: GPIO_EMC_B1_21}
  - {pin_num: H2, peripheral: SEMC, signal: 'BA, 1', pin_signal: GPIO_EMC_B1_22}
  - {pin_num: J4, peripheral: SEMC, signal: semc_ras, pin_signal: GPIO_EMC_B1_25}
  - {pin_num: G5, peripheral: SEMC, signal: semc_cke, pin_signal: GPIO_EMC_B1_27}
  - {pin_num: E5, peripheral: SEMC, signal: semc_we, pin_signal: GPIO_EMC_B1_28}
  - {pin_num: H1, peripheral: SEMC, signal: 'DATA, 15', pin_signal: GPIO_EMC_B1_37}
  - {pin_num: J17, peripheral: LPSPI1, signal: SIN, pin_signal: GPIO_AD_31, identifier: LPSPI1_SIN}
  - {pin_num: K17, peripheral: LPSPI1, signal: SOUT, pin_signal: GPIO_AD_30, identifier: LPSPI1_SOUT}
  - {pin_num: R15, peripheral: USB2, signal: usb2_otg_id, pin_signal: GPIO_AD_08}
  - {pin_num: N13, peripheral: USB2, signal: usb_otg2_oc, pin_signal: GPIO_AD_06}
  - {pin_num: T17, peripheral: USB2, signal: usb_otg2_pwr, pin_signal: GPIO_AD_07}
  - {pin_num: R16, peripheral: USB1, signal: usb1_otg_id, pin_signal: GPIO_AD_09}
  - {pin_num: P16, peripheral: USB1, signal: usb_otg1_oc, pin_signal: GPIO_AD_11}
  - {pin_num: J3, peripheral: SEMC, signal: semc_clk, pin_signal: GPIO_EMC_B1_26}
  - {pin_num: E6, peripheral: SEMC, signal: 'CS, 0', pin_signal: GPIO_EMC_B1_29}
  - {pin_num: E14, peripheral: FLEXSPI1, signal: FLEXSPI_A_DQS, pin_signal: GPIO_SD_B2_05, identifier: SDHC2_CMD, software_input_on: Enable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: Normal_Driver}
  - {pin_num: J16, peripheral: USDHC1, signal: usdhc_vselect, pin_signal: GPIO_AD_34, identifier: SDHC1_VSELECT}
  - {pin_num: B16, peripheral: USDHC1, signal: usdhc_cmd, pin_signal: GPIO_SD_B1_00, software_input_on: Enable, pdrv_config: Normal_Driver}
  - {pin_num: D15, peripheral: USDHC1, signal: usdhc_clk, pin_signal: GPIO_SD_B1_01, software_input_on: Enable, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: C15, peripheral: USDHC1, signal: 'usdhc_data, 0', pin_signal: GPIO_SD_B1_02, software_input_on: Enable, pdrv_config: Normal_Driver}
  - {pin_num: B17, peripheral: USDHC1, signal: 'usdhc_data, 1', pin_signal: GPIO_SD_B1_03, software_input_on: Enable, pdrv_config: Normal_Driver}
  - {pin_num: B15, peripheral: USDHC1, signal: 'usdhc_data, 2', pin_signal: GPIO_SD_B1_04, software_input_on: Enable, pdrv_config: Normal_Driver}
  - {pin_num: A16, peripheral: USDHC1, signal: 'usdhc_data, 3', pin_signal: GPIO_SD_B1_05, software_input_on: Enable, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: P17, peripheral: GPIO9, signal: 'gpio_io, 11', pin_signal: GPIO_AD_12, direction: OUTPUT}
  - {pin_num: L12, peripheral: GPIO9, signal: 'gpio_io, 12', pin_signal: GPIO_AD_13}
  - {pin_num: N14, peripheral: GPIO9, signal: 'gpio_io, 13', pin_signal: GPIO_AD_14, identifier: ADC_DATA_RDY}
  - {pin_num: U2, peripheral: ENET_QOS, signal: enet_mdc, pin_signal: GPIO_EMC_B2_19, identifier: ENET_QOS_MDC, pdrv_config: Normal_Driver}
  - {pin_num: K2, peripheral: LPSPI1, signal: SCK, pin_signal: GPIO_EMC_B2_00, identifier: LPSPI1_SCK}
  - {pin_num: K4, peripheral: LPSPI1, signal: PCS0, pin_signal: GPIO_EMC_B2_01, identifier: LPSPI1_PCS0}
  - {pin_num: K3, peripheral: GPIO8, signal: 'gpio_io, 12', pin_signal: GPIO_EMC_B2_02, identifier: BG95_PWRKEY}
  - {pin_num: R1, peripheral: GPIO8, signal: 'gpio_io, 13', pin_signal: GPIO_EMC_B2_03, identifier: BG95_RESET}
  - {pin_num: M1, peripheral: ENET_1G, signal: 'enet_tdata, 02', pin_signal: GPIO_EMC_B2_04, identifier: ENET_1G_TXD2, pull_down_pull_up_config: No_Pull}
  - {pin_num: N1, peripheral: ENET_1G, signal: enet_rx_clk, pin_signal: GPIO_EMC_B2_05, identifier: ENET_1G_RX_CLK, pull_down_pull_up_config: No_Pull}
  - {pin_num: T1, peripheral: GPIO8, signal: 'gpio_io, 16', pin_signal: GPIO_EMC_B2_06, identifier: GPIO8_IO16}
  - {pin_num: M3, peripheral: ENET_1G, signal: 'enet_rdata, 03', pin_signal: GPIO_EMC_B2_07, identifier: ENET_1G_RXD3, pull_down_pull_up_config: No_Pull}
  - {pin_num: P1, peripheral: ENET_1G, signal: 'enet_rdata, 02', pin_signal: GPIO_EMC_B2_08, identifier: ENET_1G_RXD2, pull_down_pull_up_config: No_Pull}
  - {pin_num: N2, peripheral: GPIO8, signal: 'gpio_io, 19', pin_signal: GPIO_EMC_B2_09, identifier: USER_LED_1, direction: OUTPUT, software_input_on: Enable}
  - {pin_num: R2, peripheral: GPIO8, signal: 'gpio_io, 20', pin_signal: GPIO_EMC_B2_10, direction: OUTPUT, software_input_on: Enable}
  - {pin_num: L4, peripheral: ENET_1G, signal: 'enet_tdata, 00', pin_signal: GPIO_EMC_B2_11, identifier: ENET_1G_TXD0, pull_down_pull_up_config: No_Pull}
  - {pin_num: M2, peripheral: ENET_1G, signal: 'enet_tdata, 01', pin_signal: GPIO_EMC_B2_12, identifier: ENET_1G_TXD1, pull_down_pull_up_config: No_Pull}
  - {pin_num: K5, peripheral: ENET_1G, signal: enet_tx_en, pin_signal: GPIO_EMC_B2_13, identifier: ENET_1G_TX_EN, pull_down_pull_up_config: No_Pull}
  - {pin_num: M4, peripheral: ENET_1G, signal: enet_tx_clk_io, pin_signal: GPIO_EMC_B2_14, identifier: ENET_1G_CLKIO, pull_down_pull_up_config: No_Pull}
  - {pin_num: L2, peripheral: ENET_1G, signal: 'enet_rdata, 00', pin_signal: GPIO_EMC_B2_15, identifier: ENET_1G_RXD0, pull_down_pull_up_config: No_Pull}
  - {pin_num: P2, peripheral: ENET_1G, signal: 'enet_rdata, 01', pin_signal: GPIO_EMC_B2_16, identifier: ENET_1G_RXD1, pull_down_pull_up_config: No_Pull}
  - {pin_num: T2, peripheral: ENET_1G, signal: enet_rx_en, pin_signal: GPIO_EMC_B2_17, identifier: ENET_1G_RX_EN, pull_down_pull_up_config: No_Pull}
  - {pin_num: N3, peripheral: GPIO8, signal: 'gpio_io, 28', pin_signal: GPIO_EMC_B2_18, identifier: USER_BUTTON}
  - {pin_num: R3, peripheral: ENET_1G, signal: enet_mdio, pin_signal: GPIO_EMC_B2_20, identifier: ENET_1G_MDIO, pull_down_pull_up_config: No_Pull}
  - {pin_num: J15, peripheral: USDHC2, signal: 'usdhc_data, 3', pin_signal: GPIO_SD_B2_00, identifier: SDHC2_DATA3}
  - {pin_num: J14, peripheral: USDHC2, signal: 'usdhc_data, 2', pin_signal: GPIO_SD_B2_01, identifier: SDHC2_DATA2}
  - {pin_num: H13, peripheral: USDHC2, signal: 'usdhc_data, 1', pin_signal: GPIO_SD_B2_02, identifier: SDHC2_DATA1}
  - {pin_num: E15, peripheral: USDHC2, signal: 'usdhc_data, 0', pin_signal: GPIO_SD_B2_03, identifier: SDHC2_DATA0}
  - {pin_num: F14, peripheral: USDHC2, signal: usdhc_clk, pin_signal: GPIO_SD_B2_04, identifier: SDHC2_CLK}
  - {pin_num: F17, peripheral: ENET_1G, signal: 'enet_tdata, 03', pin_signal: GPIO_SD_B2_06, identifier: ENET_1G_TXD3, pull_down_pull_up_config: No_Pull}
  - {pin_num: F16, peripheral: GPIO10, signal: 'gpio_io, 20', pin_signal: GPIO_SD_B2_11, identifier: RESET_ETH, direction: OUTPUT, pull_down_pull_up_config: No_Pull}
  - {pin_num: M14, peripheral: GPIO9, signal: 'gpio_io, 14', pin_signal: GPIO_AD_15, identifier: DSI_LPTE}
  - {pin_num: N17, peripheral: ENET_1G, signal: enet_mdc, pin_signal: GPIO_AD_16, identifier: ENET_1G_MDC, pull_keeper_select: Keeper}
  - {pin_num: L14, peripheral: PWM2, signal: 'A, 1', pin_signal: GPIO_AD_26}
  - {pin_num: L17, peripheral: PWM2, signal: 'A, 2', pin_signal: GPIO_AD_28, identifier: PWM2_A2}
  - {pin_num: N16, peripheral: ENET_QOS, signal: enet_mdio, pin_signal: GPIO_AD_27, identifier: ENET_QOS_MDIO}
  - {pin_num: M17, peripheral: GPIO9, signal: 'gpio_io, 28', pin_signal: GPIO_AD_29, identifier: WLAN_PD}
  - {pin_num: A15, peripheral: GPIO10, signal: 'gpio_io, 29', pin_signal: GPIO_DISP_B1_08, identifier: BOOTCFG_2}
  - {pin_num: C13, peripheral: GPIO10, signal: 'gpio_io, 30', pin_signal: GPIO_DISP_B1_09, identifier: BOOTCFG_3}
  - {pin_num: B14, peripheral: GPIO10, signal: 'gpio_io, 31', pin_signal: GPIO_DISP_B1_10, identifier: BOOTCFG_4}
  - {pin_num: A14, peripheral: GPIO11, signal: 'gpio_io, 00', pin_signal: GPIO_DISP_B1_11, identifier: BOOTCFG_5}
  - {pin_num: E9, peripheral: ENET_QOS, signal: 'enet_tdata, 00', pin_signal: GPIO_DISP_B2_02, identifier: ENET_QOS_TXD0}
  - {pin_num: D7, peripheral: ENET_QOS, signal: 'enet_tdata, 01', pin_signal: GPIO_DISP_B2_03, identifier: ENET_QOS_TXD1}
  - {pin_num: C7, peripheral: ENET_QOS, signal: enet_tx_en, pin_signal: GPIO_DISP_B2_04, identifier: ENET_QOS_TX_EN}
  - {pin_num: C9, peripheral: ENET_QOS, signal: enet_tx_clk, pin_signal: GPIO_DISP_B2_05, identifier: ENET_QOS_TXCLK}
  - {pin_num: C6, peripheral: ENET_QOS, signal: 'enet_rdata, 00', pin_signal: GPIO_DISP_B2_06, identifier: ENET_QOS_RXD0}
  - {pin_num: D6, peripheral: ENET_QOS, signal: 'enet_rdata, 01', pin_signal: GPIO_DISP_B2_07, identifier: ENET_QOS_RXD1}
  - {pin_num: B5, peripheral: ENET_QOS, signal: enet_rx_en, pin_signal: GPIO_DISP_B2_08, identifier: ENET_QOS_RX_EN}
  - {pin_num: D8, peripheral: GPIO11, signal: 'gpio_io, 10', pin_signal: GPIO_DISP_B2_09, identifier: BT_PD, direction: OUTPUT, software_input_on: Enable, slew_rate: Fast}
  - {pin_num: D9, peripheral: LPI2C3, signal: SCL, pin_signal: GPIO_DISP_B2_10, identifier: LPI2C3_SCL, software_input_on: Enable, pull_up_down_config: no_init, pull_keeper_select: Pull,
    open_drain: Enable}
  - {pin_num: A6, peripheral: LPI2C3, signal: SDA, pin_signal: GPIO_DISP_B2_11, identifier: LPI2C3_SDA, software_input_on: Enable, pull_up_down_config: no_init, pull_keeper_select: Pull,
    open_drain: Enable}
  - {pin_num: B6, peripheral: LPSPI4, signal: SCK, pin_signal: GPIO_DISP_B2_12, identifier: LPSPI4_SCK, direction: OUTPUT, pull_keeper_select: Keeper}
  - {pin_num: A5, peripheral: LPSPI4, signal: SIN, pin_signal: GPIO_DISP_B2_13, identifier: LPSPI4_SIN, direction: INPUT, pull_keeper_select: Keeper}
  - {pin_num: A7, peripheral: LPSPI4, signal: SOUT, pin_signal: GPIO_DISP_B2_14, direction: OUTPUT, pull_keeper_select: Keeper}
  - {pin_num: A4, peripheral: LPSPI4, signal: PCS0, pin_signal: GPIO_DISP_B2_15, direction: OUTPUT, pull_keeper_select: Keeper}
  - {pin_num: P6, peripheral: GPIO12, signal: 'gpio_io, 02', pin_signal: GPIO_LPSR_02, identifier: BOOTMODE_1}
  - {pin_num: T7, peripheral: GPIO12, signal: 'gpio_io, 03', pin_signal: GPIO_LPSR_03}
  - {pin_num: U8, peripheral: LPUART11, signal: TXD, pin_signal: GPIO_LPSR_08, identifier: LPUART11_TXD}
  - {pin_num: P5, peripheral: LPUART11, signal: RXD, pin_signal: GPIO_LPSR_09, identifier: LPUART11_RXD}
  - {pin_num: N8, peripheral: LPI2C5, signal: SCL, pin_signal: GPIO_LPSR_05, software_input_on: Enable, pull_up_down_config: no_init, open_drain: Enable}
  - {pin_num: N7, peripheral: LPI2C5, signal: SDA, pin_signal: GPIO_LPSR_04, software_input_on: Enable, pull_up_down_config: no_init, open_drain: Enable}
  - {pin_num: K1, peripheral: LPUART6, signal: TXD, pin_signal: GPIO_EMC_B1_40, identifier: LPUART6_TXD, pull_down_pull_up_config: Pull_Up}
  - {pin_num: L1, peripheral: LPUART6, signal: RXD, pin_signal: GPIO_EMC_B1_41, identifier: LPUART6_RXD, pull_down_pull_up_config: Pull_Up}
  - {pin_num: U6, peripheral: JTAG, signal: MOD, pin_signal: GPIO_LPSR_13}
  - {pin_num: T6, peripheral: JTAG, signal: TCK, pin_signal: GPIO_LPSR_14}
  - {pin_num: U5, peripheral: JTAG, signal: TDI, pin_signal: GPIO_LPSR_12}
  - {pin_num: T5, peripheral: JTAG, signal: TDO, pin_signal: GPIO_LPSR_11}
  - {pin_num: U7, peripheral: JTAG, signal: TMS, pin_signal: GPIO_LPSR_15}
  - {pin_num: R5, peripheral: JTAG, signal: TRSTB, pin_signal: GPIO_LPSR_10}
  - {pin_num: M16, peripheral: FLEXSPI1, signal: FLEXSPI_A_SS0_B, pin_signal: GPIO_AD_18}
  - {pin_num: L16, peripheral: FLEXSPI1, signal: FLEXSPI_A_SCLK, pin_signal: GPIO_AD_19}
  - {pin_num: K13, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA0, pin_signal: GPIO_AD_20}
  - {pin_num: K14, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA1, pin_signal: GPIO_AD_21}
  - {pin_num: K12, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA2, pin_signal: GPIO_AD_22}
  - {pin_num: J12, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA3, pin_signal: GPIO_AD_23}
  - {pin_num: M13, peripheral: GPIO3, signal: 'gpio_mux_io, 03', pin_signal: GPIO_AD_04, identifier: LPUART8_CTS, direction: OUTPUT, software_input_on: Enable, pull_keeper_select: Keeper}
  - {pin_num: P13, peripheral: GPIO3, signal: 'gpio_mux_io, 04', pin_signal: GPIO_AD_05, identifier: LPUART8_RTS}
  - {pin_num: R17, peripheral: GPIO9, signal: 'gpio_io, 09', pin_signal: GPIO_AD_10, direction: OUTPUT, software_input_on: Enable}
  - {pin_num: G17, peripheral: GPIO10, signal: 'gpio_io, 02', pin_signal: GPIO_AD_35, identifier: SDHC1_RESET_N, direction: OUTPUT, gpio_init_state: 'false', open_drain: Enable}
  - {pin_num: K16, peripheral: CM7_GPIO3, signal: 'gpio_mux_io_cm7, 31', pin_signal: GPIO_AD_32, identifier: SDHC1_CD_N, direction: INPUT, pull_up_down_config: Pull_Up}
  - {pin_num: H17, peripheral: GPIO10, signal: 'gpio_io, 00', pin_signal: GPIO_AD_33}
