tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.c
  - {pin_num: B10, peripheral: DSI_HOST, signal: 'DP, 1', pin_signal: MIPI_DSI_DP1}
  - {pin_num: A10, peripheral: DSI_HOST, signal: 'DN, 1', pin_signal: MIPI_DSI_DN1}
  - {pin_num: B9, peripheral: DSI_HOST, signal: CLKP, pin_signal: MIPI_DSI_CKP}
  - {pin_num: A9, peripheral: DSI_HOST, signal: CLKN, pin_signal: MIPI_DSI_CKN}
  - {pin_num: B8, peripheral: DSI_HOST, signal: 'DP, 0', pin_signal: MIPI_DSI_DP0}
  - {pin_num: A8, peripheral: DSI_HOST, signal: 'DN, 0', pin_signal: MIPI_DSI_DN0}
  - {pin_num: D11, peripheral: GPIO4, signal: 'gpio_mux_io, 23', pin_signal: GPIO_DISP_B1_02, identifier: DSI_CTP_IRQ, direction: INPUT, gpio_interrupt: kGPIO_IntRisingEdge,
    pull_down_pull_up_config: Pull_Down}
  - {pin_num: E11, peripheral: GPIO4, signal: 'gpio_mux_io, 24', pin_signal: GPIO_DISP_B1_03, identifier: ADC_INT, direction: INPUT, gpio_interrupt: kGPIO_IntFallingEdge,
    pull_down_pull_up_config: Pull_Up}
  - {pin_num: E13, peripheral: GPIO4, signal: 'gpio_mux_io, 21', pin_signal: GPIO_DISP_B1_00, identifier: IRQ_PE, direction: INPUT, gpio_interrupt: kGPIO_IntFallingEdge,
    pull_down_pull_up_config: No_Pull, open_drain: Disable}
  - {pin_num: G14, peripheral: GPIO4, signal: 'gpio_mux_io, 16', pin_signal: GPIO_SD_B2_07, identifier: DIG_IN_1, direction: INPUT, gpio_interrupt: no_init, software_input_on: Disable,
    pull_down_pull_up_config: No_Pull}
  - {pin_num: H14, peripheral: GPIO4, signal: 'gpio_mux_io, 19', pin_signal: GPIO_SD_B2_10, identifier: DIG_IN_4, direction: INPUT, gpio_interrupt: no_init, pull_down_pull_up_config: No_Pull}
  - {pin_num: F15, peripheral: GPIO4, signal: 'gpio_mux_io, 17', pin_signal: GPIO_SD_B2_08, identifier: DIG_IN_2, direction: INPUT, gpio_interrupt: no_init, pull_down_pull_up_config: No_Pull}
  - {pin_num: H15, peripheral: GPIO4, signal: 'gpio_mux_io, 18', pin_signal: GPIO_SD_B2_09, identifier: DIG_IN_3, direction: INPUT, gpio_interrupt: no_init, pull_down_pull_up_config: No_Pull}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  /* GPIO configuration of SDHC1_CD_N on GPIO_AD_32 (pin K16) */
  gpio_pin_config_t SDHC1_CD_N_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_32 (pin K16) */
  GPIO_PinInit(CM7_GPIO3, 31U, &SDHC1_CD_N_config);

  /* GPIO configuration of DIG_IN_1 on GPIO_SD_B2_07 (pin G14) */
  gpio_pin_config_t DIG_IN_1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_07 (pin G14) */
  GPIO_PinInit(GPIO4, 16U, &DIG_IN_1_config);

  /* GPIO configuration of DIG_IN_2 on GPIO_SD_B2_08 (pin F15) */
  gpio_pin_config_t DIG_IN_2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_08 (pin F15) */
  GPIO_PinInit(GPIO4, 17U, &DIG_IN_2_config);

  /* GPIO configuration of DIG_IN_3 on GPIO_SD_B2_09 (pin H15) */
  gpio_pin_config_t DIG_IN_3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_09 (pin H15) */
  GPIO_PinInit(GPIO4, 18U, &DIG_IN_3_config);

  /* GPIO configuration of DIG_IN_4 on GPIO_SD_B2_10 (pin H14) */
  gpio_pin_config_t DIG_IN_4_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_10 (pin H14) */
  GPIO_PinInit(GPIO4, 19U, &DIG_IN_4_config);

  /* GPIO configuration of IRQ_PE on GPIO_DISP_B1_00 (pin E13) */
  gpio_pin_config_t IRQ_PE_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntFallingEdge
  };
  /* Initialize GPIO functionality on GPIO_DISP_B1_00 (pin E13) */
  GPIO_PinInit(GPIO4, 21U, &IRQ_PE_config);
  /* Enable GPIO pin interrupt on GPIO_DISP_B1_00 (pin E13) */
  GPIO_PortEnableInterrupts(GPIO4, 1U << 21U);

  /* GPIO configuration of DSI_CTP_IRQ on GPIO_DISP_B1_02 (pin D11) */
  gpio_pin_config_t DSI_CTP_IRQ_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on GPIO_DISP_B1_02 (pin D11) */
  GPIO_PinInit(GPIO4, 23U, &DSI_CTP_IRQ_config);
  /* Enable GPIO pin interrupt on GPIO_DISP_B1_02 (pin D11) */
  GPIO_PortEnableInterrupts(GPIO4, 1U << 23U);

  /* GPIO configuration of ADC_INT on GPIO_DISP_B1_03 (pin E11) */
  gpio_pin_config_t ADC_INT_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntFallingEdge
  };
  /* Initialize GPIO functionality on GPIO_DISP_B1_03 (pin E11) */
  GPIO_PinInit(GPIO4, 24U, &ADC_INT_config);
  /* Enable GPIO pin interrupt on GPIO_DISP_B1_03 (pin E11) */
  GPIO_PortEnableInterrupts(GPIO4, 1U << 24U);

  /* GPIO configuration of USER_LED_1 on GPIO_EMC_B2_09 (pin N2) */
  gpio_pin_config_t USER_LED_1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_09 (pin N2) */
  GPIO_PinInit(GPIO8, 19U, &USER_LED_1_config);

  /* GPIO configuration of USER_LED_2 on GPIO_EMC_B2_10 (pin R2) */
  gpio_pin_config_t USER_LED_2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_10 (pin R2) */
  GPIO_PinInit(GPIO8, 20U, &USER_LED_2_config);

  /* GPIO configuration of USB1_PWR on GPIO_AD_10 (pin R17) */
  gpio_pin_config_t USB1_PWR_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_10 (pin R17) */
  GPIO_PinInit(GPIO9, 9U, &USB1_PWR_config);

  /* GPIO configuration of ADC_RST on GPIO_AD_12 (pin P17) */
  gpio_pin_config_t ADC_RST_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_12 (pin P17) */
  GPIO_PinInit(GPIO9, 11U, &ADC_RST_config);

  /* GPIO configuration of SDHC1_RESET_N on GPIO_AD_35 (pin G17) */
  gpio_pin_config_t SDHC1_RESET_N_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_35 (pin G17) */
  GPIO_PinInit(GPIO10, 2U, &SDHC1_RESET_N_config);

  /* GPIO configuration of RESET_ETH on GPIO_SD_B2_11 (pin F16) */
  gpio_pin_config_t RESET_ETH_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_11 (pin F16) */
  GPIO_PinInit(GPIO10, 20U, &RESET_ETH_config);

  /* GPIO configuration of BT_PD on GPIO_DISP_B2_09 (pin D8) */
  gpio_pin_config_t BT_PD_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_09 (pin D8) */
  GPIO_PinInit(GPIO11, 10U, &BT_PD_config);

